In [108]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [109]:
df = pd.read_csv(r"C:\Users\master\Documents\pandas\groupbyExcercise.csv")

df

,Unnamed: 0,Date,Product,Revenue,Quantity,Year,Month,Total_Product_Revenue,Revenue Percentage
0,0,2023-01-01,A,221,3,2023,1,774,28.552972
1,1,2023-01-01,B,111,8,2023,1,892,12.443946
2,2,2023-01-02,B,171,11,2023,1,892,19.170404
3,3,2023-01-02,A,141,15,2023,1,774,18.217054
4,4,2023-02-01,A,75,4,2023,2,774,9.689922
5,5,2023-02-01,B,90,12,2023,2,892,10.089686
6,6,2023-02-02,A,96,17,2023,2,774,12.403101
7,7,2023-02-02,B,170,10,2023,2,892,19.058296
8,8,2023-03-01,B,200,19,2023,3,892,22.421525
9,9,2023-03-01,A,120,10,2023,3,774,15.503876
10,10,2023-03-02,A,121,12,2023,3,774,15.633075
11,11,2023-03-02,B,150,5,2023,3,892,16.816143

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             12 non-null     int64
 1   Date                   12 non-null     object
 2   Product                12 non-null     object
 3   Revenue                12 non-null     int64
 4   Quantity               12 non-null     int64
 5   Year                   12 non-null     int64
 6   Month                  12 non-null     int64
 7   Total_Product_Revenue  12 non-null     int64
 8   Revenue Percentage     12 non-null     float64
dtypes: float64(1), int64(6), object(2)
memory usage: 996.0+ bytes

In [111]:
df.describe()

,Unnamed: 0,Revenue,Quantity,Year,Month,Total_Product_Revenue,Revenue Percentage
count,12.000000,12.000000,12.00,12.0,12.000000,12.00000,12.000000
mean,5.500000,138.833333,10.50,2023.0,2.000000,833.00000,16.666667
std,3.605551,45.095522,5.00,0.0,0.852803,61.62349,5.386673
min,0.000000,75.000000,3.00,2023.0,1.000000,774.00000,9.689922
25%,2.750000,107.250000,7.25,2023.0,1.000000,774.00000,12.433735
50%,5.500000,131.000000,10.50,2023.0,2.000000,833.00000,16.224609
75%,8.250000,170.250000,12.75,2023.0,3.000000,892.00000,19.086323
max,11.000000,221.000000,19.00,2023.0,3.000000,892.00000,28.552972

#### 1. Arrange DataFrame df, focusing on distinct product categories. Explore the data to reveal:

    * Overall revenue insights
    * Average revenue patterns
    * Peak quantity sold observations
    * Minimum quantity sold occurrences

In [112]:
df.groupby(['Product'])['Revenue'].agg((np.sum, np.mean))

         sum        mean
Product
A        774  129.000000
B        892  148.666667

In [113]:
df.groupby(['Product'])['Quantity'].agg((np.max, np.min))

         amax  amin
Product
A          17     3
B          19     5

#### 2 Aggregate DataFrame df by extracting the month and year from the 'Date' column. Calculate the collective revenue for each unique combination of month and year.

In [114]:
df.groupby(['Revenue']).agg({'Year': 'unique', 'Month': 'unique'})

           Year Month
Revenue
75       [2023]   [2]
90       [2023]   [2]
96       [2023]   [2]
111      [2023]   [1]
120      [2023]   [3]
121      [2023]   [3]
141      [2023]   [1]
150      [2023]   [3]
170      [2023]   [2]
171      [2023]   [1]
200      [2023]   [3]
221      [2023]   [1]

In [115]:
df.groupby(['Year', 'Month', 'Date']).agg({'Revenue': 'sum'})

                       Revenue
Year Month Date
2023 1     2023-01-01      332
           2023-01-02      312
     2     2023-02-01      165
           2023-02-02      266
     3     2023-03-01      320
           2023-03-02      271

#### 3. Group the DataFrame df by the 'Date' column and find the date with the highest total revenue and the date with the highest total quantity sold.

In [116]:
df.loc[df['Revenue'].idxmax()]

Unnamed: 0                        0
Date                     2023-01-01
Product                           A
Revenue                         221
Quantity                          3
Year                           2023
Month                             1
Total_Product_Revenue           774
Revenue Percentage        28.552972
Name: 0, dtype: object

In [117]:
df.loc[df['Quantity'].idxmax()]

Unnamed: 0                        8
Date                     2023-03-01
Product                           B
Revenue                         200
Quantity                         19
Year                           2023
Month                             3
Total_Product_Revenue           892
Revenue Percentage        22.421525
Name: 8, dtype: object

In [118]:
df.groupby('Date').agg({'Revenue': 'sum', 'Quantity': 'sum'}).idxmax()

Revenue     2023-01-01
Quantity    2023-03-01
dtype: object

#### 4. Group the DataFrame df by the Date and find products that have a total quantity sold greater than 10 and less than 15 .

In [119]:
(df['Quantity'] > 10) & (df['Quantity'] < 15)

0     False
1     False
2      True
3     False
4     False
5      True
6     False
7     False
8     False
9     False
10     True
11    False
Name: Quantity, dtype: bool

In [129]:
a = df.groupby(['Date', 'Product'])['Quantity'].sum()
b = x[(x > 10) & (x < 15)]

b

Date        Product
2023-01-02  B          11
2023-02-01  B          12
2023-03-02  A          12
Name: Quantity, dtype: int64

#### 5. Group the DataFrame df by the 'Product' column and add a new column 'Revenue Percentage' that shows the percentage of each product's revenue relative to the total revenue for that product.

In [121]:
a = df.groupby(['Product'])['Revenue'].sum()

a / a.sum() * 100

Product
A    46.458583
B    53.541417
Name: Revenue, dtype: float64

In [125]:
df.groupby(['Product','Revenue'])['Revenue Percentage'].mean()

Product  Revenue
A        75          9.689922
         96         12.403101
         120        15.503876
         121        15.633075
         141        18.217054
         221        28.552972
B        90         10.089686
         111        12.443946
         150        16.816143
         170        19.058296
         171        19.170404
         200        22.421525
Name: Revenue Percentage, dtype: float64

In [127]:
per = a / a.sum() * 100
df['Product'].map(per)

0     46.458583
1     53.541417
2     53.541417
3     46.458583
4     46.458583
5     53.541417
6     46.458583
7     53.541417
8     53.541417
9     46.458583
10    46.458583
11    53.541417
Name: Product, dtype: float64